
const platformData = [
  {
    section: "الموقع الإلكتروني التعريفي للمدرسة",
    description: "تصميم مخصص للمدرسة ويكون Dynamic، مع امكانية تعديل المحتوى من لوحة التحكم.",
    features: [
     
      "ا مكانية التعديل الكامل على محتوى الموقع من خلال لوحة التحكم",
      "امكانية اضافة أخبار جديدة للمدرسة",
      "امكانية اضافة خطة أسبوعية",
      "التقديم عبر الإنترنت",
      "تسجيل بيانات الطالب بالمرحلة التي سيلتحق بها",
      "تسجيل بيانات الأب والأم والولاية التعليمية"
    ]
  },
  {
    section: "Pioneers E-School LMS",
    description: "منصة خاصة بالطلاب والمعلمين وأولياء الأمور.",
    accounts: [
      {
        type: "حساب نظام المعلم",
        features: [
          "انشاء اختبارات عبر الإنترنت",
          "اضافة واجب منزلي",
          "رفع مرفقات للطلاب",
          "اضافة فصل ذكي",
          "اضافة تحضيرات",
          "رفع فيديوهات مسجلة",
          "اضافة صور",
          "معرفة الخطط الأسبوعية",
          "معرفة جدول الحصص",
          "ترصيد النتائج الشهرية للطلاب",
          "منصة التواصل الاجتماعي ومحادثات وقنوات بث مباشر",
          "مشاركة المحتوى والفصول الحية للتدريس الفعال عبر الإنترنت",
          "مشاركة المواد والوثائق التعليمية بشكل منظم وفعال"
        ]
      },
      {
        type: "حساب نظام الطالب",
        features: [
          "استعراض الواجب المنزلي والامتحانات ونتائج الامتحانات",
          "عرض الصور والفيديوهات والمرفقات المرسلة من قبل المدرس",
          "الدخول في الفصول الذكية",
          "عرض جدول الحصص والخطط المدرسية",
          "وجود مخزن خاص بالفيديوهات والصور والمستندات",
          "امكانية عمل محادثات جزئية مع المدرس أو طالب آخر"
        ]
      },
      {
        type: "حساب نظام ولي الأمر",
        features: [
          "معرفة الواجبات والامتحانات والمرفقات والصور والفيديوهات",
          "معرفة جدول الحصص والخطط الأسبوعية وخطة توزيع المناهج",
          "متابعة تقييمات الأبناء في المواد والنتائج الشهرية وكشف الحساب الخاص بالأبناء",
          "معرفة مواعيد الأقساط وامكانية طباعة مطالبة بالقسط"
        ]
      }
    ]
  },
  {
    section: "Call to Action",
    description: "ابدأ بالتطوير مع منظومة إدارة المدارس Pioneers E-School ERP لمعرفة المزيد حول نظام تخطيط موارد المؤسسات المدرسية.",
    action: "تواصل معنا الآن واطلب عرض تجريبي مجاني"
  }
];

export default platformData;
