// import { Items } from './../../../node_modules/framer-motion/dist/types/index.d';
// src/data/data.ts
export const sections = [
    {
        id: 1,
        number: 1,
        title: "المنطقة الإدارية",
        items: [
            "مزامنة للبيانات على السيستم الإداري مع الموقع الإلكتروني وتطبيق الموبيل.",
            "عمل مزامنة للمرفقات مثل صور الطلاب في حال اضافتها على السيستم الإداري يتم ظهورها على الويب سايت والموبيل ابليكيشن.",
            "يساعد في عمل تقرير للمستخدمين على السيستم من خلال تقرير الـ history.",
            "تصميم التقارير مع امكانية التعديل عليها.",
            "يساعد في تنظيم هيكلة الشئون التعليمية والهيكل الإداري للمدرسة أو الفروع الخاصة بالمدرسة.",
            "عمل ضبط اعدادات البريد الإلكتروني وارسال الرسائل لأولياء الأمور لإبلاغهم بغياب ابنائهم.",
            "اضافة عدد لا نهائي من الجنسيات وجميع العملات واضافة بيانات المدرسة والتعديل عليها وتحديد بداية ونهاية العام الدراسي.",
            "وضع صلاحيات لمجموعات المستخدمين واضافة المستخدمين على السيستم وتحديد ما إذا كان المستخدم له الصلاحية للعمل على (مرحلة معينة – صف معين – فصل معين)."
        ],
    },
    {
        id: 2,
        title: "إدارة شئون الطلاب",
        items: [
            "اضافة بيانات الطالب بالكامل متضمناً بيانات ولى الامر",
            "تحديد البيانات الاساسية والمعلومات الشخصية المهمة لكل طالب المشتركة مع جميع الطلاب",
            "الإضافة والتعديل على بيانات ولى الامر",
            "عمل طلب اجازة للطالب",
            "اعتماد طلبات اجازات الطلاب",
            "ترحيل الطلاب",
            "امكانية البحث المتقدم لمعرفة الطلاب الموجودين فى مرحلة تعليمية معينة",
            "توزيع الطلاب على الفصول",
            "عمل بطاقة تعريفية خاصة لكل طالب",
            "امكانية اضافة الطلاب يدوياً او من خلال شيت اكسيل",
            "تسجيل غيابات واذونات الطلاب",
            "تسجيل المرفقات الخاصة بالطلاب",
            "تسجيل أوراق تقديم الطلاب بعد استلامها",
            "موديول كامل لكافة تقارير الطلاب حيث انها تعطيك نظرة اوسع وأدق حول جميع بيانات الطلاب في المدرسة."
        ],
    },
    {
        id: 3,
        title: "إدارة حسابات الطلاب",
        items: [
            "اضافة بنود الرسوم",
            "اضافة رسوم الصفوف",
            "اضافة مديونية للطلاب",
            "نظام تقسيط الاشتراك ودفع الرسوم المقررة",
            "تدفيع الرسوم للطلاب",
            "اضافة مصروفات اختيارية مجمعه",
            "عمل تقرير حسابات طلاب مجمع",
            "عمل تقرير البنود والخزن للطلاب",
            "اضافة رسوم تسجيل الطلاب",
            "وضع اعدادات الخصومات",
            "عمل تنزيل للخصومات",
            "حذف مديونيات اجبارية للطلاب",
            "عمل مطالبة الرسوم",
            "تقرير الاسترجاع وملخص مدفوعات الطلاب وبيان إجمالي الرسوم الدراسية."
        ],
    },
    {
        id: 4,
        title: "إدارة الحسابات العامة",
        items: [
            "الدليل المحاسبي (شجرة الحسابات)",
            "عمل القيود اليومية",
            "اذونات الصرف والقبض",
            "عمل مراكز تكلفة",
            "تحديد بداية ونهاية السنة المالية",
            "تحديد دفاتر القبض والصرف",
            "اضافة مسميات البنوك والخزن",
            "عمل كشف حساب",
            "عمل القيود المختصرة وميزان المراجعة",
            "البحث بالإيصالات ووضع اعدادات الخصومات وانشاء الارصدة الافتتاحية",
            "متوافق مع لوائح الضرائب والمحاسبة في مصر والسعودية",
            "إدارة الرسوم والنفقات والرسوم المتنوعة والشيكات ودفاتر الحسابات والتحويلات والودائع وسحب الأموال",
            "إنشاء تقارير الدخل والمصروفات."
        ],
    },
    {
        id: 5,
        title: "إدارة الموارد البشرية",
        items: [
            "الملفات التعريفية للعاملين (المؤهلات والكورسات والمعلومات الشخصية).",
            "وضع اعدادات شئون العاملين",
            "وضع اعدادات التأمينات والضرائب",
            "تحديد أنظمة العمل",
            "ربط أجهزة البصمة بالبرنامج",
            "اضافة جميع أنواع الاذونات والرواتب والبدلات والاجازات والاستقطاعات",
            "تحديد العطلات الرسمية",
            "تحديد قواعد الوقت الإضافي والمكافآت والجزاءات."
        ],
    },
    {
        id: 6,
        title: "المرشد الطلابي",
        items: [
            "اضافة تصنيف للمخالفات",
            "اضافة مخالفات على الطلاب",
            "عمل دراسة حالة لطالب معين",
            "عمل تقرير لمخالفات الطلاب",
            "ارسال رسائل SMS لأولياء الامور لإبلاغهم بمخالفات الطلاب."
        ],
    },
    {
        id: 7,
        title: "إدارة البوابة والاستقبال",
        items: [
            "تسجيل الزيارات",
            "انهاء الزيارات",
            "تقرير الزيارات",
            "تسجيل مدخلات البوابة",
            "استقبال المكالمات",
            "تقارير المكالمات",
            "تقرير مدخلات البوابة."
        ],
    },
    {
        id: 8,
        title: "إدارة عيادة المدرسة",
        items: [
            "تسجيل العيادات والاطباء والتخصصات والتشخيصات",
            "عمل ملف طبي خاص لكل طالب",
            "اضافة كشف طبي",
            "عمل تقرير بجميع الكشوفات الطبية."
        ],
    },
    {
        id: 9,
        title: "إدارة المكتبات",
        items: [
            "تحديد أقسام المكتبة",
            "وضع اعدادات المكتبة",
            "اضافة كتاب يدوياً",
            "عمل استعارة للكتب واعادتها",
            "عمل تقارير متعددة مثل كتب مستعارة لم ترجع بعد، عرض تفاصيل الكتاب، الكتب المستهلكة خلال فترة.",
            "عمل اهلاك للكتب",
            "تقرير الكتب المفقودة",
            "تقرير عرض تاريخ الاستعارة لكل طالب",
            "عمل بحث بالمكتبة",
            "جرد المخزن بالباركود."
        ],
    },
    {
        id: 10,
        title: "إدارة الكنترول المدرسي",
        items: [
            "ترصيد عناصر المواد",
            "ترصيد درجات المواد",
            "ترصيد نتائج الترم الاول والثاني",
            "عرض نتائج الترم الاول والثاني",
            "اضافة اعمال الكنترول مثل إضافة كنترول، لجان، أرقام الجلوس بطريقة عشوائية أو سيريال، أرقام سرية.",
            "عمل كشف مناداة بجميع الطلاب",
            "اضافة أعضاء الكنترول."
        ],
    },
    {
        id: 11,
        title: "إدارة المخازن",
        items: [
            "إدارة الاصناف وحالة كل صنف",
            "إدارة المخازن والعملاء",
            "اذن صرف صنف",
            "اذن اضافة صنف لمخزن",
            "إدارة الموردين",
            "عروض الاصناف وتحويل من مخزن لمخزن",
            "اعتماد تحويلات المخازن",
            "اعدادات الاصناف",
            "فاتورة مشتريات وفاتورة مبيعات",
            "تحديد طريقة الدفع (نقدي أو شيكات)",
            "عمل عرض للفواتير",
            "تسجيل اذن تسليم صنف."
        ],
    },
    {
        id: 12,
        title: "جدول الحصص المدرسي",
        items: [
            "انشاء جدول الحصص بطريقة سهلة حسب الصف والفصل.",
            "ادخال بيانات بناءً على الفرع والصف.",
            "هيكلة الأوقات وربطها بالصف الدراسي.",
            "تعيين المدرسين المرتبطين بالفصل والحصة الدراسية.",
            "تنظيم أوقات الحصص وتقسيمها للحصة الاولى - الثانية - الخ.",
            "تحديد فترات الجدول المدرسي مع إمكانية التبديل بين الحصص."
        ],
    },
    {
        id: 13,
        title: "إدارة الحافلات",
        items: [
            "تعزيز سلامة الطلاب وتتبع حالة السيارة وجمع رسوم النقل.",
            "ادارة خطوط الحافلة، إضافة المحطات واشتراكات الطلاب للحافلة.",
            "الاحتفاظ بسجلات المركبات وتتبع نفقات النقل.",
            "تبسيط عملية تحصيل رسوم اشتراك الحافلات."
        ],
    },
];
