import Button from "./components/Button";
import img from "@/assets/img/imge.png";
export default function Hero() {
  return (
    <div
      className="text-center px-4 py-6 sm:px-6 sm:py-8 md:px-12 md:py-10 
    lg:px-20 lg:py-16 space-y-6"
    >
      <Button />

      <h1 className="text-2xl sm:text-3xl md:text-5xl font-bold text-cyan-700">
        أفضل برنامج تخطيط موارد المؤسسات المدرسية
      </h1>

      <p className="text-gray-900 text-base sm:text-lg md:text-xl lg:text-2xl leading-relaxed text-center">
        نظام تخطيط موارد المؤسسات التعليمية الكل في واحد لمساعدتك في الانتقال
        إلى نظام رقمي بالكامل. برنامج School ERP هو عبارة عن نظام أساسي يساعد في
        إدارة المهام التعليمية والإدارية اليومية من منصة واحدة، توفر Pioneers
        E-School ERP تجربة سهلة الاستخدام مع إمكانية الوصول لتسجيل الدخول
        للمعلمين والموظفين غير المدرسين والطلاب وأولياء الأمور وموظفي الإدارة في
        مؤسستك. تعمل الوحدات المختلفة المتوفرة في برنامج تخطيط موارد المؤسسات
        المدرسية على أتمتة العمليات اليومية لمؤسستك، مثل إدارة قبول الطلاب إلى
        رقمنه تجربة التعلم عبر الإنترنت، كل ذلك يمكن إدارته بسهولة.
      </p>

      <img
        src={img}
        alt="Hero Image"
        className="w-full max-w-md mx-auto mt-6"
      />

      <span className="text-gray-900 text-base sm:text-lg md:text-xl lg:text-1xl leading-relaxed text-justify">
        لدى Pioneers E-School ERP وحدات نمطية لإدارة الجدول الزمني، والحضور،
        والفصول الدراسية عبر الإنترنت، والامتحانات، ودفاتر الدرجات، والتعلم
        المتنقل، والمكتبة، والمواصلات، والتقويم المدرسي، والأحداث، وغير ذلك
        الكثير، يحتوي على وحدة موارد بشرية كاملة لإدارة كشوف المرتبات وقسائم
        رواتب الموظفين، تساعدك الوحدة المالية على تخطيط وتخصيص هياكل الرسوم
        المختلفة للطلاب، يعد Pioneers E-School ERP System أيضًا أداة تعاون
        ممتازة باستخدام المكونات الإضافية والمناقشة والاستطلاع والمدونة
        والمؤتمرات المرئية. منظومة ادارة المدارس Pioneers E-School منظومة
        متكاملة تم انشاءها تحت مراقبة خبراء في ادارة المدارس الدولية واللغات مع
        مراعات استخدام احدث الوسائل التكنولوجية في لاستكمال العملية التعليمية
        وتعزيز نظام التعليم المدمج في المدارس. تتكون المنظومة من جزء ادارى
        School Management System لإدارة جميع أقسام المدرسة وجزء للتعليم عن بعد
        Learning Management System لإدارة عملية التعليم خارج الفصل الدراسي
        بالمدرسة وتسهيل التواصل مع الطالب والمدرس وولى الامر بالإضافة الى mobile
        application لاستكمال عملية التواصل مع اهم عناصر المنظومة التعليمية
        والمتمثلة في الطالب والمدرس وولى الامر.
      </span>
    </div>
  );
}
